#### Terraform Plan 📋 `dev/kubernetes`

**Summary:** 19:39:22.446 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.

<details><summary>Show Plan Details</summary>

```terraform
19:39:19.902 STDOUT terraform: Initializing plugins and modules...
19:39:22.444 STDOUT terraform: Terraform used the selected providers to generate the following execution
19:39:22.444 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
19:39:22.445 STDOUT terraform:   + create
19:39:22.445 STDOUT terraform: Terraform will perform the following actions:
19:39:22.445 STDOUT terraform:   # digitalocean_kubernetes_cluster.k8s will be created
19:39:22.445 STDOUT terraform:   + resource "digitalocean_kubernetes_cluster" "k8s" {
19:39:22.445 STDOUT terraform:       + auto_upgrade                     = true
19:39:22.445 STDOUT terraform:       + cluster_subnet                   = (known after apply)
19:39:22.445 STDOUT terraform:       + created_at                       = (known after apply)
19:39:22.445 STDOUT terraform:       + destroy_all_associated_resources = false
19:39:22.445 STDOUT terraform:       + endpoint                         = (known after apply)
19:39:22.445 STDOUT terraform:       + ha                               = false
19:39:22.445 STDOUT terraform:       + id                               = (known after apply)
19:39:22.445 STDOUT terraform:       + ipv4_address                     = (known after apply)
19:39:22.445 STDOUT terraform:       + kube_config                      = (sensitive value)
19:39:22.445 STDOUT terraform:       + name                             = "dev-cluster"
19:39:22.445 STDOUT terraform:       + region                           = "fra1"
19:39:22.445 STDOUT terraform:       + registry_integration             = false
19:39:22.445 STDOUT terraform:       + service_subnet                   = (known after apply)
19:39:22.445 STDOUT terraform:       + status                           = (known after apply)
19:39:22.445 STDOUT terraform:       + surge_upgrade                    = true
19:39:22.445 STDOUT terraform:       + updated_at                       = (known after apply)
19:39:22.445 STDOUT terraform:       + urn                              = (known after apply)
19:39:22.445 STDOUT terraform:       + version                          = "1.35.1-do.1"
19:39:22.445 STDOUT terraform:       + vpc_uuid                         = "e03da057-a388-4dad-8772-4556a18cf652"
19:39:22.445 STDOUT terraform:       + amd_gpu_device_metrics_exporter_plugin (known after apply)
19:39:22.445 STDOUT terraform:       + amd_gpu_device_plugin (known after apply)
19:39:22.446 STDOUT terraform:       + control_plane_firewall (known after apply)
19:39:22.446 STDOUT terraform:       + maintenance_policy {
19:39:22.446 STDOUT terraform:           + day        = "saturday"
19:39:22.446 STDOUT terraform:           + duration   = (known after apply)
19:39:22.446 STDOUT terraform:           + start_time = "03:00"
19:39:22.446 STDOUT terraform:         }
19:39:22.446 STDOUT terraform:       + node_pool {
19:39:22.446 STDOUT terraform:           + actual_node_count = (known after apply)
19:39:22.446 STDOUT terraform:           + auto_scale        = true
19:39:22.446 STDOUT terraform:           + id                = (known after apply)
19:39:22.446 STDOUT terraform:           + labels            = {
19:39:22.446 STDOUT terraform:               + "owner"    = "DevOps-Team"
19:39:22.446 STDOUT terraform:               + "priority" = "high"
19:39:22.446 STDOUT terraform:               + "service"  = "app"
19:39:22.446 STDOUT terraform:             }
19:39:22.446 STDOUT terraform:           + max_nodes         = 4
19:39:22.446 STDOUT terraform:           + min_nodes         = 2
19:39:22.446 STDOUT terraform:           + name              = "dev-app-pool"
19:39:22.446 STDOUT terraform:           + node_count        = 2
19:39:22.446 STDOUT terraform:           + nodes             = (known after apply)
19:39:22.446 STDOUT terraform:           + size              = "s-2vcpu-2gb"
19:39:22.446 STDOUT terraform:           + tags              = [
19:39:22.446 STDOUT terraform:               + "component:kubernetes",
19:39:22.446 STDOUT terraform:               + "environment:dev",
19:39:22.446 STDOUT terraform:               + "project:my-devops-project",
19:39:22.446 STDOUT terraform:             ]
19:39:22.446 STDOUT terraform:         }
19:39:22.446 STDOUT terraform:       + nvidia_gpu_device_plugin (known after apply)
19:39:22.446 STDOUT terraform:       + rdma_shared_device_plugin (known after apply)
19:39:22.446 STDOUT terraform:       + routing_agent (known after apply)
19:39:22.446 STDOUT terraform:     }
19:39:22.446 STDOUT terraform:   # digitalocean_kubernetes_node_pool.monitoring will be created
19:39:22.446 STDOUT terraform:   + resource "digitalocean_kubernetes_node_pool" "monitoring" {
19:39:22.446 STDOUT terraform:       + actual_node_count = (known after apply)
19:39:22.446 STDOUT terraform:       + auto_scale        = false
19:39:22.446 STDOUT terraform:       + cluster_id        = (known after apply)
19:39:22.446 STDOUT terraform:       + id                = (known after apply)
19:39:22.446 STDOUT terraform:       + labels            = {
19:39:22.446 STDOUT terraform:           + "owner"    = "DevOps-Team"
19:39:22.446 STDOUT terraform:           + "priority" = "low"
19:39:22.446 STDOUT terraform:           + "service"  = "monitoring"
19:39:22.446 STDOUT terraform:         }
19:39:22.446 STDOUT terraform:       + max_nodes         = 2
19:39:22.446 STDOUT terraform:       + min_nodes         = 1
19:39:22.446 STDOUT terraform:       + name              = "dev-monitoring-pool"
19:39:22.446 STDOUT terraform:       + node_count        = 1
19:39:22.446 STDOUT terraform:       + nodes             = (known after apply)
19:39:22.446 STDOUT terraform:       + size              = "s-2vcpu-4gb"
19:39:22.446 STDOUT terraform:       + tags              = [
19:39:22.446 STDOUT terraform:           + "component:kubernetes",
19:39:22.446 STDOUT terraform:           + "environment:dev",
19:39:22.446 STDOUT terraform:           + "project:my-devops-project",
19:39:22.446 STDOUT terraform:         ]
19:39:22.446 STDOUT terraform:       + taint {
19:39:22.446 STDOUT terraform:           + effect = "NoSchedule"
19:39:22.446 STDOUT terraform:           + key    = "service"
19:39:22.446 STDOUT terraform:           + value  = "monitoring"
19:39:22.446 STDOUT terraform:         }
19:39:22.446 STDOUT terraform:     }
19:39:22.446 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
19:39:22.446 STDOUT terraform: Changes to Outputs:
19:39:22.446 STDOUT terraform:   + app_node_pool_id        = (known after apply)
19:39:22.446 STDOUT terraform:   + cluster_ca_certificate  = (sensitive value)
19:39:22.446 STDOUT terraform:   + cluster_id              = (known after apply)
19:39:22.446 STDOUT terraform:   + cluster_token           = (sensitive value)
19:39:22.446 STDOUT terraform:   + endpoint                = (known after apply)
19:39:22.446 STDOUT terraform:   + kubeconfig              = (sensitive value)
19:39:22.447 STDOUT terraform:   + monitoring_node_pool_id = (known after apply)
19:39:22.512 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
19:39:22.512 STDOUT terraform: Saved the plan to: tfplan
19:39:22.512 STDOUT terraform: To perform exactly these actions, run the following command to apply:
19:39:22.512 STDOUT terraform:     terraform apply "tfplan"
```

</details>

*Pusher: @krukmaksym, Action: `pull_request`, Workflow: `Terraform PR Validation`*